site/app/views/comments/_form.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."request_id" = ?  [["request_id", 9]]
---
  <h3>Comments:</h3>
  <% @request.comments.each do |comment| %>