site/app/views/comments/_form.html.erb


  <% @request.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."request_id" = ?  [["request_id", 24]]