site/app/controllers/comments_controller.rb

    def create

        @request = Request.find(params[:request_id])

        @comment = @request.comments.build(comment_params)
        @comment.user = current_user
        if @comment.save
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
INSERT INTO "comments" ("request_id", "user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["request_id", 9], ["user_id", 6], ["body", "hey"], ["created_at", "2023-06-05 21:42:55.382987"], ["updated_at", "2023-06-05 21:42:55.382987"]]

     def update
        @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

      def destroy_all
        @request = Request.find(params[:request_id])
        @request.comments.destroy_all
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 11]]

      def destroy
        @request = Request.find(params[:request_id])
        @comment = @request.comments.find(params[:id])
        @comment.destroy
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."request_id" = ? AND "comments"."id" = ? LIMIT ?  [["request_id", 25], ["id", 11], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 11]]