site/app/controllers/requests_controller.rb

  def index
    @requests = Request.order(created_at: :desc)
---
SELECT "requests".* FROM "requests" ORDER BY "requests"."created_at" DESC

  def create
    @request = current_user.requests.build(request_params)

    respond_to do |format|
      if @request.save
---
INSERT INTO "requests" ("category", "first_name", "last_name", "email", "phone", "text_of_request", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @request.update(request_params)
---
UPDATE "requests" SET "category" = ?, "updated_at" = ? WHERE "requests"."id" = ?  [["category", "Transportation"], ["updated_at", "2023-06-05 22:30:38.213520"], ["id", 22]]

  def destroy
    @request = Request.find(params[:id])
    @request.comments.destroy_all # Видаляємо всі коментарі пов'язані з запитом
    @request.destroy # Видаляємо сам запит
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 23]]
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 28]]